---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalMember
source: html/57c87ac5-a82e-5c7e-2f06-6dbf1f697566.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalMember

Represents a linear element in the structural analytical model.

## Syntax (C#)
```csharp
public class AnalyticalMember : AnalyticalElement
```